<?php

return [
	'object_not_found' => 'ไม่พบข้อมูลที่ค้นหา',
	'self_delete' => 'ไม่สามารถลบตัวเองได้',
	'constraint' => 'ไม่สามารถลบได้ มีโมดูลอื่นใช้งานอยู่',
	'invalid_date_format' => 'รูปแบบของวันที่ ไม่ถูกต้อง',
	'no_query' => 'ไม่มี ข้อมูลสำหรับค้นหา',
	'invalid_status' => 'สถานะของข้อมูลไม่ถูกต้อง',
	'invalid_cancel_child_item_active' => 'ไม่สามารถยกเลิกรายการนี้ได้ เนื่องจากมีรายการย่อยที่มีสถานะ ใช้งาน อยู่',
	'invalid_cancel_selected_child_item_active' => 'ไม่สามารถยกเลิกรายการเหล่านี้ได้ เนื่องจากมีรายการย่อยที่มีสถานะ ใช้งาน อยู่',
	'invalid_cancel_document' => 'ไม่สามารถยกเลิกเอกสารนี้ได้ เอกสารอื่นในสายการทำงาน ยังคงมีสถานะใช้งานอยู่',
	'related_document_not_found' => 'ไม่พบเอกสารที่เกี่ยวข้อง',
	'child_document_already_generate' => 'เอกสารลูกได้ถูกสร้างอยู่ก่อนแล้ว',
	'invalid_argument' => 'ค่าที่ส่งมาไม่ถูกต้อง',
	'business_exception' => 'มีข้อผิดพลาดขณะกำลังทำงาน กรุณาติดต่อผู้ดูแลระบบ'
];