<?php

return [
	'object_not_found' => 'ไม่พบข้อมูลที่ค้นหา',
	'self_delete' => 'ไม่สามารถลบตัวเองได้',
	'constraint' => 'มีสามารถลบได้ มีโมดูลอื่นใช้งานอยู่',
	'invalid_date_format' => 'รูปแบบของวันที่ ไม่ถูกต้อง',
	'no_query' => 'ไม่มี ข้อมูลสำหรับค้นหา',
	'invalid_status' => 'สถานะของข้อมูลไม่ถูกต้อง',
	'invalid_cancel_child_item_active' => 'ไม่สามารถยกเลิกรายการนี้ได้ เนื่องจากมีรายการย่อยที่มีสถานะ ใช้งาน อยู่',
	'invalid_cancel_selected_child_item_active' => 'ไม่สามารถยกเลิกรายการเหล่านี้ได้ เนื่องจากมีรายการย่อยที่มีสถานะ ใช้งาน อยู่'
];